# IS 362 â€“ Week 7 Assignment

In [1]:
import numpy as np
import pandas as pd

In [2]:
ratings = pd.read_csv('Viewer_Ratings.csv', index_col = 0)
ratings

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,5.0,4.0,3,NaN,NaN,4.0
Logan,4.0,NaN,3,3.0,NaN,NaN
Modesto,NaN,NaN,4,NaN,4.0,4.0
Malcolm,NaN,NaN,2,NaN,4.0,NaN
Maurice,5.0,4.0,4,2.0,3.0,3.0

In [3]:
average = ratings.mean()
score_avg = pd.DataFrame(average)
score_avg.columns = ['Film Rating Average']
score_avg

                     Film Rating Average
American Sniper                 4.666667
Edge of Tomorrow                4.000000
Groundhog Day                   3.200000
Jurassic World                  2.500000
Lost in Translation             3.666667
Lucy                            3.666667

In [4]:
viewer_score = ratings.mean(axis=1)
view_avg = pd.DataFrame(viewer_score)
view_avg.columns = ['Viewer Score Average']
view_avg

         Viewer Score Average
John                 4.000000
Logan                3.333333
Modesto              4.000000
Malcolm              3.000000
Maurice              3.500000

In [15]:
ratings_z_scaled = ratings.copy()
movies = list(ratings.columns)

ratings_z_scaled = (ratings_z_scaled[movies] - ratings_z_scaled[movies].mean()) / ratings_z_scaled[movies].std()
ratings_z_scaled

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,0.577350,NaN,-0.239046,NaN,NaN,0.577350
Logan,-1.154701,NaN,-0.239046,0.707107,NaN,NaN
Modesto,NaN,NaN,0.956183,NaN,0.577350,0.577350
Malcolm,NaN,NaN,-1.434274,NaN,0.577350,NaN
Maurice,0.577350,NaN,0.956183,-0.707107,-1.154701,-1.154701

In [13]:
norm_film_ratings = ratings_z_scaled.mean()
normalized_film_average = pd.DataFrame(norm_film_ratings)
normalized_film_average.columns = ['Normalized Film Rating Average']
normalized_film_average

                     Normalized Film Rating Average
American Sniper                       -5.181041e-16
Edge of Tomorrow                                NaN
Groundhog Day                         -1.998401e-16
Jurassic World                         0.000000e+00
Lost in Translation                    2.960595e-16
Lucy                                   2.960595e-16

In [6]:
#movies = list(ratings.columns)
#standardized_film_average = ratings.groupby(movies).mean()
#standardized_film_average.T

In [7]:
#audience = list(ratings.T.columns)
# Adding the "T" substitiutes the need for axis=1, it switches the column and row/index headers
#standardized_audience_average = ratings.T.groupby(audience).mean()
#standardized_audience_average.T